tutorials/multiphase/interIsoHFDIBFoam/submarineFromAirToWater/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
    //~ default         CrankNicolson 0.75;
}

gradSchemes
{
    //~ default         pointCellsLeastSquares;
    default         Gauss linear;
    // default         Gauss linear;
    // default         cellMDLimited Gauss linear 1.0;
    //~ default          leastSquares;
    //~ grad(body)       pointCellsLeastSquares;
    //~ grad(body)       leastSquares;
    grad(body)       linear;
}

divSchemes
{
    default         none;
    //~ default         Gauss linear;
    div(rhoPhi,U)   Gauss linearUpwind grad(U);
    div(phi,alpha)  Gauss vanLeer;
    div(phirb,alpha) Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(((lambda*(1|A(U)))*f))  Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;
}


// ************************************************************************* //
